<!doctype html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <link rel="stylesheet" href="src/inc.css">
    <link rel="stylesheet" href="public/css/styles.css">
    <link rel="stylesheet" href="views/layouts/user/css/custom.css">
    <script type="text/javascript"
            src="https://api-maps.yandex.ru/2.1/?apikey=b1e40b4d-bc1d-4931-adf1-bd7fa552de3d&lang=ru_RU"
    ></script>
    <script async type="text/javascript">ymaps.ready(init);function init(){const myMap=new ymaps.Map("map",{center:[55.7836727202492,37.41978394437688],zoom:12,controls:[]},{searchControlProvider:'yandex#search'},{restrictMapArea:[[55.832457411019995,37.36024701453022],[55.73482340616052,37.52353360846928]]})<?php$locations=mysqli_fetch_all(services\Connect::Connect()->query("SELECT * FROM `location_entity`"));foreach($locations as $location){?>var myCircle=new ymaps.Circle([[<?=$location[1]?>,<?=$location[2]?>],3],{balloonContent:"",hintContent:""},{draggable:!1,fillColor:"#F1343E",strokeColor:"#F1343E",strokeWidth:5});myMap.geoObjects.add(myCircle);<?php}?>var myPolygon=new ymaps.Polygon([[[55.81069028431499,37.391384081751724],[55.811165489348554,37.38932017285004],[55.823343442287225,37.39361170727368],[55.82305353550436,37.39592913586256],[55.821990525404004,37.39721659618953],[55.82170060849707,37.39944819408976],[55.82141068941995,37.400993146482634],[55.82237707790636,37.4013364692366],[55.82281194486114,37.400134839598024],[55.82324680693412,37.4013364692366],[55.8227636265514,37.40296725231752],[55.82189388667643,37.40288142162899],[55.820492598029276,37.40494135815222],[55.81918790441674,37.40717295605329],[55.81775107212509,37.40938732935067],[55.816204654349086,37.41161892725097],[55.81383658252262,37.41556713892082],[55.81166169520685,37.41745541406761],[55.80972835957275,37.42260525537618],[55.80856831190116,37.42792675806117],[55.80779492749797,37.43247578455073],[55.80856831190116,37.43822644067915],[55.81284676223023,37.442507467938526],[55.8162297640894,37.44765730924768],[55.81922589054071,37.45091887540966],[55.819612470627156,37.4541804415717],[55.815166566756744,37.451262198163455],[55.80975347350977,37.44817229337814],[55.80511307751155,37.44800063200162],[55.80163241594486,37.44885893888582],[55.79776464768743,37.44868727750908],[55.79455775692319,37.45372852742751],[55.792623568167656,37.45372852742751],[55.792623568167656,37.447892040610846],[55.78706745023281,37.44750051327336],[55.78339169936043,37.4478438360274],[55.77990908779217,37.448187158781245],[55.77768392230122,37.45076207943555],[55.775748892065906,37.45745687313679],[55.77332996858715,37.46174840756038],[55.769517638605656,37.46824341976613],[55.769517638605656,37.47596818172918],[55.76700155114351,37.47922974789129],[55.764582082480125,37.479573070645436],[55.76246544979511,37.474547393820096],[55.759803715008424,37.47514820863951],[55.75583497160814,37.47626400758997],[55.752613919764606,37.47618158440155],[55.75304956949499,37.48141725639885],[55.75333999993419,37.485880452199105],[55.75309797471937,37.495922642750955],[55.75242029609319,37.49721010307831],[55.75043559781467,37.49635179619358],[55.74869285229975,37.497124272389634],[55.74782145022318,37.49746759514322],[55.745196367845814,37.487372015394726],[55.74321130047103,37.47956142274371],[55.74020929862737,37.469004248060486],[55.73730391472731,37.45904788819769],[55.736238552873154,37.45475635377349],[55.73718833420413,37.45229502845607],[55.7366556553433,37.45066424537495],[55.73617139549804,37.44903346229403],[55.73617139549804,37.4468876950823],[55.7349607194867,37.445171081312715],[55.73827213330783,37.43857211276104],[55.742533182534586,37.4344522397148],[55.74446986863743,37.431705657683146],[55.74630963102486,37.42964572115943],[55.747762013477704,37.42552584811287],[55.75221564777605,37.41857356234689],[55.75328057163341,37.415655318938015],[55.75318376158011,37.413767043791225],[55.754442273451936,37.412393752775984],[55.75553444406957,37.41348601746685],[55.75567965027047,37.41520263123649],[55.75587325769371,37.41674758362868],[55.75638147258814,37.41824962067714],[55.75626046964494,37.41970874238139],[55.75638147258814,37.4208674566758],[55.75647827467087,37.421897424937356],[55.75626046964494,37.42288447785452],[55.757397882425316,37.419880403758384],[55.75817227206511,37.419880403758384],[55.75894664626402,37.42069579529855],[55.75906764083783,37.4212536947738],[55.76030176395481,37.42219783234714],[55.76059214016467,37.42056704926581],[55.76168103161256,37.419022096873576],[55.76192300334362,37.41756297516905],[55.76240694228081,37.41627551484213],[55.76361960245206,37.41767476352093],[55.76410352024412,37.419048054536326],[55.76579718501682,37.41681645663589],[55.76695851244491,37.41527150424327],[55.767877872021224,37.41372655185111],[55.76906676011277,37.41499259451944],[55.76979253269737,37.41739585379666],[55.77027637354774,37.42065741995822],[55.76984091705335,37.42340400198987],[55.76887321846505,37.42623641470987],[55.76926030079539,37.42829635123292],[55.77167947791019,37.42580726126758],[55.7720665322573,37.4225456951047],[55.77216329524097,37.41619422415796],[55.77187300556636,37.41001441458715],[55.771450391741084,37.40515071503314],[55.77174068457674,37.399314228217065],[55.7692247412079,37.40103084198599],[55.76530535071378,37.402489963690314],[55.76230505605324,37.404120746771206],[55.75926301079633,37.400426315898486],[55.75781105833577,37.396993088359174],[55.75410613661914,37.40382828113028],[55.752363555780775,37.405544894899315],[55.748781338533554,37.400051730837056],[55.745198790931816,37.394386905397184],[55.743455810482665,37.391468661989116],[55.74093803401546,37.3907820164813],[55.73919486242999,37.395245212282504],[55.7374516126498,37.39198364612034],[55.736289402686666,37.3907820164813],[55.7343523088484,37.392498630251055],[55.73367430319617,37.38958038684294],[55.7343523088484,37.38717712756525],[55.73328686608525,37.38580383654983],[55.733190006203856,37.38013901111037],[55.73425545162238,37.37773575183317],[55.73493344713652,37.37498916980187],[55.738878117345955,37.37398600784493],[55.746818663810636,37.369007827913535],[55.760178359392654,37.36969447342109],[55.76736749585391,37.369587059256546],[55.76639973560473,37.37782680535041],[55.764657706361454,37.38400661492089],[55.76330274068655,37.387611503836666],[55.76523839146107,37.38984310173717],[55.76581906787565,37.39258968376788],[55.76756104500837,37.39447795891455],[55.76775459319879,37.38898479485249],[55.76862554811087,37.38400661492089],[55.77007709620869,37.386924858328854],[55.771818882278154,37.38709651970572],[55.77278650743295,37.38177501702035],[55.77239946026598,37.375938530203975],[55.77104476478526,37.37027370476438],[55.774915197862256,37.370102043387384],[55.77878524498463,37.37027370476438],[55.78284837910382,37.3706170275184],[55.787684888787616,37.37405025505713],[55.78903900344974,37.37628185295756],[55.78874884000133,37.38126003288916],[55.786814361542945,37.38623821282104],[55.78217121963737,37.38984310173717],[55.780913606403296,37.38829814934447],[55.78013967030617,37.38967144035984],[55.78101034733012,37.39361965203012],[55.781494048345635,37.39602291130755],[55.78081686523556,37.39876949333862],[55.781590787825166,37.40151607536994],[55.78371899535245,37.39894115471559],[55.78575035727588,37.39928447746923],[55.787201264958505,37.402031059500445],[55.787201264958505,37.40409099602409],[55.7880717835209,37.40529262566287],[55.78942588467743,37.40735256218589],[55.792327371219876,37.40855419182533],[55.79174709135136,37.40580760979388],[55.79348790491225,37.40443431877846],[55.79435828239203,37.40271770500885],[55.795615459822535,37.40546428704009],[55.79484181699596,37.40821086907154],[55.79658249165163,37.40906917595614],[55.79890326965503,37.4116440966107],[55.80122390876271,37.412330742118435],[55.80286761076276,37.40821086907154],[55.80383446174032,37.403404350516986],[55.805284692996665,37.39945613884681],[55.805671412168856,37.39619457268475],[55.808281665676994,37.39516460442307],[55.80973173056591,37.39670955681569],[55.81156840154395,37.39851200127381],[55.81234171065346,37.39576541924241],[55.81311500433938,37.39258968376865],[55.81069028431499,37.391384081751724]]],{hintContent:"Москворецкий парк"},{fillColor:'#fff',strokeColor:'#F1343E',fillOpacity:0.2,strokeWidth:2});myMap.geoObjects.add(myPolygon);myPolygon.events.add('click',function(e){if(!myPolygon.balloon.isOpen()){var coords=e.get('coords');myPolygon.balloon.open(coords,{contentHeader:'Событие!',contentBody:'<p>Кто-то щелкнул по карте.</p>'+'<p>Координаты щелчка: '+[coords[0].toPrecision(6),coords[1].toPrecision(6)].join(', ')+'</p>',contentFooter:'<sup>Щелкните еще раз</sup>'})}else{myMap.balloon.close()}});myPolygon.events.add('balloonopen',function(e){myPolygon.hint.close()})}</script>
    <title>Главная страница - Красная Книга Москвы</title>
</head>
<body class="bg-white text-black overflow-x-hidden">
    <header class="w-full flex justify-center fixed bg-white max-h-[100px] min-h-[80px] z-50 xl:min-h-[120px] shadow-sm">
        <div class="w-[90%] flex items-center justify-between py-2 px-8 z-30">
            <div class="relative">
                <a class="w-fit flex bg-main min-h-[80px] pr-5 rounded-r-[30px] before:-[''] before:absolute before:top-0 before:right-[100%] before:bg-main before:h-full before:w-[50vw]">
                    <img src="public/media/icons/logo.svg" alt="Логотип сайта" height="30" width="100">
                </a>
            </div>
            <nav>
                <ul class="flex gap-16 xl:text-2xl font-medium">
                    <li>
                        <a class="py-5" href="#park">Парки</a>
                    </li>
                    <li>
                        <a class="py-5" href="#flora">Флора</a>
                    </li>
                    <li>
                        <a class="py-5" href="#fauna">Фауна</a>
                    </li>
                    <li>
                        <a class="py-5" href="#comment-section">Предложения</a>
                    </li>
                </ul>
            </nav>
        </div>
    </header>
    <main class="w-full h-auto pt-32">
        <section class="w-full py-10 flex justify-center">
            <div class="w-[85%]">
                <h1 class="xl:text-5xl font-bold uppercase">Флора и фауна в красной книге <span class="text-accent">Москвы</span></h1>
                <p class="xl:text-xl pt-3 font-medium whitespace-pre-line">Красная книга — важный инструмент защиты природных
                    экосистем Москвы и основа для разработки
                    природоохранных мер в городах</p>
            </div>
        </section>
        <section id="park" class="w-full py-10 flex justify-center">
            <div class="flex flex-col w-[85%] gap-10">
                <h2 class="w-fit flex self-end items-center gap-2 bg-main text-white xl:text-4xl min-h-[80px] pl-5 rounded-l-[30px] relative">Узнать о <span class="text-accent after:-[''] before:absolute before:top-0 before:left-[100%] before:bg-main before:h-full before:w-[50vw]">видах</span></h2>
                <div id="map" class="self-center h-[600px] w-[50%] border-main border-solid border-2"><span class="sr-only">Карта</span></div>
                <label class="w-[85%] relative block self-center">
                    <span class="sr-only">Поиск по видам</span>
                    <span class="absolute inset-y-0 right-0 flex items-center pr-4">
                        <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                          <mask id="path-1-inside-1_940_321" fill="white">
                            <path d="M38.9702 40.3081L26.4462 27.7841C25.4462 28.6361 24.2962 29.2954 22.9962 29.7621C21.6962 30.2288 20.3895 30.4621 19.0762 30.4621C15.8735 30.4621 13.1629 29.3534 10.9442 27.1361C8.72554 24.9188 7.61621 22.2088 7.61621 19.0061C7.61621 15.8034 8.72421 13.0921 10.9402 10.8721C13.1562 8.65209 15.8655 7.54076 19.0682 7.53809C22.2709 7.53542 24.9829 8.64476 27.2042 10.8661C29.4255 13.0874 30.5362 15.7988 30.5362 19.0001C30.5362 20.3894 30.2902 21.7341 29.7982 23.0341C29.3062 24.3341 28.6595 25.4461 27.8582 26.3701L40.3822 38.8921L38.9702 40.3081ZM19.0782 28.4601C21.7315 28.4601 23.9715 27.5468 25.7982 25.7201C27.6249 23.8934 28.5382 21.6528 28.5382 18.9981C28.5382 16.3434 27.6249 14.1034 25.7982 12.2781C23.9715 10.4528 21.7315 9.53942 19.0782 9.53809C16.4249 9.53676 14.1842 10.4501 12.3562 12.2781C10.5282 14.1061 9.61488 16.3461 9.61621 18.9981C9.61754 21.6501 10.5309 23.8901 12.3562 25.7181C14.1815 27.5461 16.4215 28.4594 19.0762 28.4581" />
                          </mask>
                          <path d="M38.9702 40.3081L26.4462 27.7841C25.4462 28.6361 24.2962 29.2954 22.9962 29.7621C21.6962 30.2288 20.3895 30.4621 19.0762 30.4621C15.8735 30.4621 13.1629 29.3534 10.9442 27.1361C8.72554 24.9188 7.61621 22.2088 7.61621 19.0061C7.61621 15.8034 8.72421 13.0921 10.9402 10.8721C13.1562 8.65209 15.8655 7.54076 19.0682 7.53809C22.2709 7.53542 24.9829 8.64476 27.2042 10.8661C29.4255 13.0874 30.5362 15.7988 30.5362 19.0001C30.5362 20.3894 30.2902 21.7341 29.7982 23.0341C29.3062 24.3341 28.6595 25.4461 27.8582 26.3701L40.3822 38.8921L38.9702 40.3081ZM19.0782 28.4601C21.7315 28.4601 23.9715 27.5468 25.7982 25.7201C27.6249 23.8934 28.5382 21.6528 28.5382 18.9981C28.5382 16.3434 27.6249 14.1034 25.7982 12.2781C23.9715 10.4528 21.7315 9.53942 19.0782 9.53809C16.4249 9.53676 14.1842 10.4501 12.3562 12.2781C10.5282 14.1061 9.61488 16.3461 9.61621 18.9981C9.61754 21.6501 10.5309 23.8901 12.3562 25.7181C14.1815 27.5461 16.4215 28.4594 19.0762 28.4581" fill="#212121" />
                          <path d="M38.9702 40.3081L35.4347 43.8436L38.9752 47.3842L42.5107 43.8386L38.9702 40.3081ZM26.4462 27.7841L29.9817 24.2486L26.7175 20.9843L23.2036 23.9782L26.4462 27.7841ZM19.0762 30.4621V25.4621V30.4621ZM27.8582 26.3701L24.0808 23.0942L21.0293 26.6128L24.323 29.9059L27.8582 26.3701ZM40.3822 38.8921L43.9227 42.4226L47.4486 38.8868L43.9175 35.3563L40.3822 38.8921ZM42.5057 36.7726L29.9817 24.2486L22.9107 31.3196L35.4347 43.8436L42.5057 36.7726ZM23.2036 23.9782C22.6861 24.4191 22.0686 24.7827 21.3069 25.0561L24.6855 34.4681C26.5239 33.8082 28.2064 32.8531 29.6889 31.59L23.2036 23.9782ZM21.3069 25.0561C20.5206 25.3384 19.7844 25.4621 19.0762 25.4621V35.4621C20.9947 35.4621 22.8718 35.1191 24.6855 34.4681L21.3069 25.0561ZM19.0762 25.4621C17.1679 25.4621 15.7379 24.8579 14.4787 23.5995L7.40974 30.6727C10.5879 33.8489 14.5792 35.4621 19.0762 35.4621V25.4621ZM14.4787 23.5995C13.2202 22.3418 12.6162 20.9134 12.6162 19.0061H2.61621C2.61621 23.5041 4.23085 27.4957 7.40974 30.6727L14.4787 23.5995ZM12.6162 19.0061C12.6162 17.0967 13.2205 15.6652 14.4789 14.4044L7.40149 7.33975C4.22794 10.519 2.61621 14.5101 2.61621 19.0061H12.6162ZM14.4789 14.4044C15.7362 13.1449 17.1647 12.5397 19.0724 12.5381L19.064 2.53809C14.5664 2.54184 10.5763 4.15924 7.40149 7.33975L14.4789 14.4044ZM19.0724 12.5381C20.9765 12.5365 22.4064 13.1393 23.6687 14.4016L30.7397 7.33056C27.5594 4.15019 23.5652 2.53434 19.064 2.53809L19.0724 12.5381ZM23.6687 14.4016C24.9325 15.6654 25.5362 17.0965 25.5362 19.0001H35.5362C35.5362 14.501 33.9186 10.5094 30.7397 7.33056L23.6687 14.4016ZM25.5362 19.0001C25.5362 19.7845 25.4 20.5295 25.1219 21.2643L34.4745 24.8039C35.1804 22.9387 35.5362 20.9944 35.5362 19.0001H25.5362ZM25.1219 21.2643C24.8103 22.0876 24.4473 22.6717 24.0808 23.0942L31.6356 29.646C32.8718 28.2205 33.8021 26.5806 34.4745 24.8039L25.1219 21.2643ZM24.323 29.9059L36.847 42.4279L43.9175 35.3563L31.3935 22.8343L24.323 29.9059ZM36.8417 35.3616L35.4297 36.7776L42.5107 43.8386L43.9227 42.4226L36.8417 35.3616ZM19.0782 33.4601C23.0174 33.4601 26.5413 32.0481 29.3337 29.2556L22.2627 22.1846C21.4018 23.0455 20.4457 23.4601 19.0782 23.4601V33.4601ZM29.3337 29.2556C32.1267 26.4627 33.5382 22.9378 33.5382 18.9981H23.5382C23.5382 20.3677 23.1231 21.3242 22.2627 22.1846L29.3337 29.2556ZM33.5382 18.9981C33.5382 15.0583 32.1266 11.5334 29.3325 8.74127L22.264 15.8149C23.1232 16.6735 23.5382 17.6286 23.5382 18.9981H33.5382ZM29.3325 8.74127C26.5404 5.95125 23.0179 4.54007 19.0807 4.53809L19.0757 14.5381C20.4452 14.5388 21.4027 14.9543 22.264 15.8149L29.3325 8.74127ZM19.0807 4.53809C15.1396 4.53611 11.6143 5.94892 8.82068 8.74256L15.8917 15.8136C16.7541 14.9513 17.7101 14.5374 19.0757 14.5381L19.0807 4.53809ZM8.82068 8.74256C6.02757 11.5357 4.61423 15.0601 4.61621 19.0006L14.6162 18.9956C14.6155 17.6321 15.0289 16.6765 15.8917 15.8136L8.82068 8.74256ZM4.61621 19.0006C4.61819 22.9371 6.0298 26.4587 8.8181 29.251L15.8943 22.1851C15.032 21.3215 14.6169 20.363 14.6162 18.9956L4.61621 19.0006ZM8.8181 29.251C11.6106 32.0476 15.1369 33.4601 19.0787 33.4581L19.0737 23.4581C17.7062 23.4588 16.7525 23.0446 15.8943 22.1851L8.8181 29.251Z" fill="#212121" mask="url(#path-1-inside-1_940_321)" />
                        </svg>
                    </span>
                    <input class="placeholder:text-main text-2xl block bg-white w-full border-main border-[3px] rounded-[30px] py-5 pl-7 pr-6 transition duration-200 lg:hover:border-hover active:border-hover focus:border-accent focus:outline-accent focus:ring-0 focus:ring-accent" placeholder="Поиск по видам" type="text" name="search"/>
                </label>
            </div>
        </section>
        <section class="w-full py-10 pb-5 flex justify-center">
            <div class="flex flex-col w-[85%] gap-12">
                <div class="flex justify-between relative">
                    <h2 id="flora" class="w-fit flex self-end items-center gap-2 bg-main text-white font-medium xl:text-4xl xl:!leading-[0px] min-h-[80px] pr-5 rounded-r-[30px] before:-[''] before:absolute before:top-0 before:right-[100%] before:bg-main before:h-full before:w-[50vw]">
                        <svg width="64" height="64" viewBox="0 0 64 64" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M61.9072 11.9724C61.8787 11.4831 61.6714 11.0214 61.3249 10.6748C60.9783 10.3282 60.5165 10.121 60.0272 10.0924C47.0872 9.34241 36.6972 13.2774 32.2322 20.6474C29.2822 25.5199 29.2872 31.4374 32.1922 37.0824C30.5385 39.0506 29.33 41.3533 28.6497 43.8324L24.5822 39.7499C26.5372 35.6674 26.4622 31.4124 24.3322 27.8774C21.0322 22.4299 13.4147 19.5099 3.95725 20.0649C3.46796 20.0935 3.0062 20.3007 2.65963 20.6473C2.31307 20.9939 2.10582 21.4556 2.07725 21.9449C1.51975 31.4024 4.44225 39.0199 9.88975 42.3199C11.6873 43.4184 13.7531 43.9998 15.8597 43.9999C17.9045 43.9746 19.9174 43.4901 21.7497 42.5824L27.9997 48.8324V55.9999C27.9997 56.5303 28.2105 57.0391 28.5855 57.4141C28.9606 57.7892 29.4693 57.9999 29.9997 57.9999C30.5302 57.9999 31.0389 57.7892 31.414 57.4141C31.789 57.0391 31.9997 56.5303 31.9997 55.9999V48.6274C31.9906 45.4456 33.0734 42.357 35.0672 39.8774C37.6396 41.2218 40.4925 41.9413 43.3947 41.9774C46.2007 41.9865 48.9545 41.2199 51.3522 39.7624C58.7222 35.3024 62.6672 24.9124 61.9072 11.9724ZM11.9522 38.8999C8.11725 36.5774 5.94725 31.0799 5.99975 23.9999C13.0797 23.9399 18.5772 26.1174 20.8997 29.9524C22.1122 31.9524 22.3097 34.2849 21.5147 36.6874L15.4122 30.5849C15.0341 30.2257 14.5306 30.0284 14.0091 30.035C13.4876 30.0417 12.9893 30.2518 12.6205 30.6207C12.2517 30.9895 12.0415 31.4877 12.0349 32.0093C12.0282 32.5308 12.2255 33.0343 12.5847 33.4124L18.6872 39.5149C16.2847 40.3099 13.9548 40.1124 11.9522 38.8999ZM49.2797 36.3449C45.9297 38.3724 41.9922 38.5274 37.9922 36.8449L51.4147 23.4199C51.774 23.0418 51.9713 22.5383 51.9646 22.0168C51.958 21.4952 51.7478 20.997 51.379 20.6282C51.0102 20.2593 50.5119 20.0492 49.9904 20.0425C49.4689 20.0359 48.9654 20.2332 48.5872 20.5924L35.1622 33.9999C33.4722 29.9999 33.6247 26.0599 35.6622 22.7124C39.1472 16.9624 47.4122 13.7574 57.9947 14.0049C58.2347 24.5849 55.0347 32.8599 49.2797 36.3449Z" fill="#F1343E" />
                        </svg>
                        Флора
                    </h2>
                    <h2 id="fauna" class="w-fit flex self-end items-center gap-2 bg-main text-white font-medium xl:text-4xl xl:!leading-[0px] min-h-[80px] pl-5 rounded-l-[30px] after:-[''] before:absolute before:top-0 before:left-[100%] before:bg-main before:h-full before:w-[50vw]">
                        Фауна
                        <svg width="64" height="64" viewBox="0 0 64 64" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M20.6667 50.6667C18.7993 50.6668 17.0021 49.9545 15.6419 48.675C14.2817 47.3956 13.4608 45.6453 13.3467 43.7814L13.3334 43.3334V40.0001C11.9369 40.0003 10.5647 39.635 9.35319 38.9404C8.14169 38.2459 7.1331 37.2463 6.4277 36.0411C5.7223 34.8359 5.34466 33.4671 5.33234 32.0707C5.32002 30.6742 5.67344 29.2989 6.35747 28.0815C7.04149 26.864 8.03229 25.8468 9.23134 25.131C10.4304 24.4152 11.7959 24.0257 13.1922 24.0013C14.5884 23.9769 15.9668 24.3184 17.1901 24.9918C18.4135 25.6653 19.4392 26.6473 20.1654 27.8401C21.5698 27.1692 23.0914 26.7779 24.6454 26.6881L25.3334 26.6667H36L36.6614 26.6854L37.3147 26.7387L37.6534 26.7841L37.9467 26.3387L38.296 25.8641L33.5574 21.1254C31.6907 19.2587 31.496 16.3574 32.9707 14.2721L33.2454 13.9147L33.5574 13.5734C35.5307 11.6001 38.672 11.4934 40.7707 13.2614L41.1094 13.5734L55.5414 28.0081C57.0031 29.4699 58.0086 31.325 58.4355 33.3477C58.8623 35.3705 58.6922 37.4737 57.9459 39.4015C57.1995 41.3294 55.9089 42.9988 54.2313 44.2067C52.5536 45.4146 50.5611 46.109 48.496 46.2054L47.896 46.2161L47.4107 46.1974L47.3414 46.3681C46.8275 47.499 46.0348 48.4809 45.0375 49.2216C44.0403 49.9623 42.8712 50.4376 41.64 50.6027L41.128 50.6534L40.664 50.6667H20.6667ZM38.28 16.4027C38.044 16.1645 37.7272 16.0236 37.3923 16.0078C37.0574 15.9919 36.7287 16.1023 36.4713 16.3172C36.2139 16.532 36.0465 16.8357 36.0022 17.168C35.9578 17.5004 36.0399 17.8373 36.232 18.1121L36.3867 18.2987L43.8747 25.7867L42.1734 27.4987C41.6116 28.0623 41.1467 28.681 40.7787 29.3547L40.52 29.8667L39.8107 31.4241L38.1627 30.9627C37.6367 30.8155 37.097 30.7226 36.552 30.6854L35.9974 30.6667H25.3334C23.4667 30.6667 21.752 31.3067 20.392 32.3734L20.0107 32.6934L19.5707 33.1201L19.3227 33.3867L19.0267 33.7441L18.704 34.1894L18.592 34.3601C18.4818 34.529 18.3796 34.7032 18.2854 34.8827L18.1307 35.1814L17.9654 35.5467L17.8747 35.7707L17.7387 36.1494L17.592 36.6401C17.5236 36.9011 17.4684 37.1654 17.4267 37.4321L17.3974 37.6534L17.3494 38.1574L17.3334 38.6667V43.3334C17.3334 45.0614 18.6454 46.4801 20.3254 46.6507L20.6667 46.6667H32.0027V46.0107C32.0031 45.1859 31.6978 44.3902 31.1456 43.7775C30.5935 43.1648 29.8338 42.7785 29.0134 42.6934L28.672 42.6774H26.0054C25.495 42.6826 25.002 42.4925 24.6273 42.146C24.2525 41.7995 24.0244 41.3229 23.9897 40.8137C23.9549 40.3046 24.1161 39.8014 24.4403 39.4072C24.7645 39.013 25.2271 38.7576 25.7334 38.6934L26.0054 38.6774H28.672C30.5395 38.6773 32.3366 39.3896 33.6968 40.6691C35.0571 41.9486 35.8779 43.6988 35.992 45.5627L36.0054 46.0107L36.0027 46.6667H40.6667C42.2427 46.6667 43.584 45.5627 43.9147 44.0667L43.968 43.7414L44.2347 41.5014L46.4267 42.0294C47.8005 42.3638 49.2451 42.2528 50.5517 41.7123C51.8583 41.1719 52.9593 40.23 53.6954 39.0227C54.4316 37.8155 54.7648 36.4055 54.647 34.9964C54.5292 33.5874 53.9664 32.2523 53.04 31.1841L52.7147 30.8374L38.28 16.4027ZM13.3334 28.0027C12.3104 28.0092 11.3287 28.4073 10.5903 29.1153C9.85184 29.8232 9.41271 30.7872 9.36319 31.809C9.31367 32.8308 9.65753 33.8328 10.3241 34.6088C10.9906 35.3849 11.9291 35.8761 12.9467 35.9814L13.3334 35.9974L13.6374 35.9841L13.6507 35.9174C13.7449 35.5192 13.8569 35.1298 13.9867 34.7494L14.2454 34.0694L14.528 33.4401L14.68 33.1387L15.0267 32.5147L15.2614 32.1414L15.648 31.5814L15.8454 31.3201L16.1334 30.9627L16.4774 30.5707L16.8774 30.1521C16.3174 29.0854 15.304 28.3121 14.112 28.0774L13.7094 28.0187L13.3334 28.0027Z" fill="#F1343E" />
                        </svg>
                    </h2>
                </div>
                <article class="w-full flex items-center justify-between max-h-[250px] bg-main rounded-[30px] py-6 pl-6 pr-8">
                    <div class="w-full flex items-center justify-start gap-8">
                        <img class="w-auto rounded-l-[30px] rounded-r-[15px] max-h-[220px]" src="public/media/img/animals/zayaz-belayk.png" alt="Заяц-Беляк" width="339" height="306" loading="lazy">
                        <header class="text-white">
                            <h3 class="w-max xl:text-4xl border-b-2 border-b-accent border-dashed">Заяц-Беляк</h3>
                            <p class="xl:text-2xl font-semibold whitespace-pre-line">
                                <span>Lepus timidus (Linnaeus, 1758)</span>
                                <span>Отряд Зайцеобразные – Lagomorpha</span>
                                <span> Семейство Зайцевые – Leporidae</span>
                            </p>
                        </header>
                    </div>
                    <button class="bg-white px-10 py-5 rounded-l-[30px] rounded-r-[30px]">
                        <svg width="94" height="38" viewBox="0 0 100 38" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M3.00098 16.5C1.62026 16.5 0.500977 17.6193 0.500977 19C0.500977 20.3807 1.62026 21.5 3.00098 21.5V16.5ZM98.7682 20.7678C99.7445 19.7915 99.7445 18.2085 98.7682 17.2322L82.8583 1.32233C81.882 0.34602 80.2991 0.34602 79.3228 1.32233C78.3465 2.29864 78.3465 3.88155 79.3228 4.85786L93.4649 19L79.3228 33.1421C78.3465 34.1184 78.3465 35.7014 79.3228 36.6777C80.2991 37.654 81.882 37.654 82.8583 36.6777L98.7682 20.7678ZM3.00098 21.5H97.0005V16.5H3.00098V21.5Z" fill="#F1343E" />
                        </svg>
                    </button>
                </article>
                <article class="w-full flex items-center justify-between max-h-[250px] bg-main rounded-[30px] py-6 pl-6 pr-8">
                    <div class="w-full flex items-center justify-start gap-8">
                        <img class="w-auto rounded-l-[30px] rounded-r-[15px] max-h-[220px]" src="public/media/img/animals/zayaz-belayk.png" alt="Заяц-Беляк" width="339" height="306" loading="lazy">
                        <header class="text-white">
                            <h3 class="w-max xl:text-4xl border-b-2 border-b-accent border-dashed">Заяц-Беляк</h3>
                            <p class="xl:text-2xl font-semibold whitespace-pre-line">
                                <span>Lepus timidus (Linnaeus, 1758)</span>
                                <span>Отряд Зайцеобразные – Lagomorpha</span>
                                <span> Семейство Зайцевые – Leporidae</span>
                            </p> 
                        </header>
                    </div>
                    <button class="bg-white px-10 py-5 rounded-l-[30px] rounded-r-[30px]">
                        <svg width="94" height="38" viewBox="0 0 100 38" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M3.00098 16.5C1.62026 16.5 0.500977 17.6193 0.500977 19C0.500977 20.3807 1.62026 21.5 3.00098 21.5V16.5ZM98.7682 20.7678C99.7445 19.7915 99.7445 18.2085 98.7682 17.2322L82.8583 1.32233C81.882 0.34602 80.2991 0.34602 79.3228 1.32233C78.3465 2.29864 78.3465 3.88155 79.3228 4.85786L93.4649 19L79.3228 33.1421C78.3465 34.1184 78.3465 35.7014 79.3228 36.6777C80.2991 37.654 81.882 37.654 82.8583 36.6777L98.7682 20.7678ZM3.00098 21.5H97.0005V16.5H3.00098V21.5Z" fill="#F1343E" />
                        </svg>
                    </button>
                </article>
            </div>
        </section>
        <section id="comment-section" class="w-full py-10 pt-5 flex justify-center">
            <div class="flex flex-col w-[85%]">
                <h2 class="xl:text-4xl font-semibold pb-14">Предложите новый объект флоры и фауны</h2>
                <div class="flex justify-between gap-12">
                    <p class="w-1/2 font-medium">Вы можете помочь экспертизе проектной документации по благоустройству и жителям <span class="text-accent">Москвы</span>, прикрепив фото новых объектов флоры и фауны, найденных в <span class="text-accent">Москворецком парке</span></p>
                    <form action="#" class="w-1/2 flex flex-col justify-center items-center ">
                        <label class="w-full block pb-5">
                            <span class="sr-only">Прикрепите фото</span>
                            <input id="files" name="files[]" type="file" multiple="multiple" accept="image/*" placeholder="Прикрепите фото" class="block w-full text-sm text-slate-500
                                file:mr-4 file:py-3 file:px-4 file:pr-16
                                file:rounded-[20px] file:border-[3px]
                                file:text-sm file:font-normal
                                file:bg-transparent file:text-black cursor-pointer
                                lg:hover:file:border-accent active:file:border-accent focus:file:border-accent focus:file:outline-accent focus:file:ring-2 focus:file:ring-accent focus:outline-main focus:ring-2 focus:ring-main"/>
                        </label>
                        <label for="comment" class="w-full">
                            <textarea name="comment" id="comment" placeholder="Оставить комментарий" rows="5" class="w-full border-main border-[3px] rounded-[15px] resize-none placeholder:text-main lg:hover:border-accent active:border-accent focus:border-accent focus:outline-accent focus:ring-0 focus:ring-accent"></textarea>
                        </label>
                        <div>
                            <div>
                                <label for="flora-comment"
                                       class="flex items-center border-solid border-2 border-border rounded-[50px] pl-4 lg:hover:*:cursor-pointer hover:cursor-pointer group lg:hover:border-mainHover active:border-mainHover transition-all duration-200">
                                    <label for="telegram"
                                           class="relative flex items-center *:cursor-pointer">
                                        <input class="relative peer w-5 h-5 text-white/10 bg-white/10 border-none appearance-none rounded-full transition-all duration-200
                                                       group-hover:ring-offset-transparent group-hover:ring-mainHover group-hover:ring-offset-0 group-hover:ring-2
                                                       focus:ring-offset-transparent focus:ring-mainHover focus:ring-offset-0 focus:ring-2
                                                       hover:ring-mainHover checked:bg-none"
                                               type="radio" name="contactMethod" required
                                               value="Telegram" id="telegram"/>
                                        <span class="absolute bg-main w-2 h-2 rounded-full opacity-0 peer-checked:opacity-100 transition-opacity duration-200 top-1/2 left-1/2 transform -translate-x-1/2 -translate-y-1/2"></span>
                                    </label>
                                    <label class="inline-block text-white text-sm mt-px py-4 pl-2 pr-4 xl:text-base"
                                           for="telegram">Флора
                                    </label>
                                </label>
                                <label for="fauna-comment"
                                       class="flex items-center border-solid border-2 border-border rounded-[50px] pl-4 lg:hover:*:cursor-pointer hover:cursor-pointer group lg:hover:border-mainHover active:border-mainHover transition-all duration-200">
                                    <label for="phone"
                                           class="relative flex items-center *:cursor-pointer">
                                        <input class="relative peer w-5 h-5 text-white/10 bg-white/10 border-none appearance-none rounded-full transition-all duration-200
                                                       group-hover:ring-offset-transparent group-hover:ring-mainHover group-hover:ring-offset-0 group-hover:ring-2
                                                       focus:ring-offset-transparent focus:ring-mainHover focus:ring-offset-0 focus:ring-2
                                                       hover:ring-mainHover checked:bg-none"
                                               type="radio" name="contactMethod" checked required
                                               value="по номеру телефона" id="phone"/>
                                        <span class="absolute bg-main w-2 h-2 rounded-full opacity-0 peer-checked:opacity-100 transition-opacity duration-200 top-1/2 left-1/2 transform -translate-x-1/2 -translate-y-1/2"></span>
                                    </label>
                                    <label class="inline-block text-white text-sm mt-px py-4 pl-2 pr-4 xl:text-base"
                                           for="phone">Фауна
                                    </label>
                                </label>
                            </div>
                            <button class="w-full flex justify-center items-center bg-main text-white font-semibold transition duration-200 rounded-[30px] text-xl uppercase py-3 px-20 lg:hover:bg-hover active:bg-hover focus:bg-hover focus:border-accent focus:outline-accent focus:ring-0 focus:ring-accent"
                                    type="submit" name="send-comment">
                                Отправить
                            </button>
                        </div>
                    </form>
                </div>
            </div>
        </section>
    </main>
    <footer class="w-full flex justify-center max-h-[100px] min-h-[80px] xl:min-h-[120px]">
        <div class="w-[90%] flex items-center justify-between py-2 px-8 border-accent">
            <div class="relative">
                <a class="w-fit flex bg-main min-h-[80px] pr-3 rounded-r-[30px] before:-[''] before:absolute before:top-0 before:right-[100%] before:bg-main before:h-full before:w-[50vw]">
                    <img src="public/media/icons/logo.svg" alt="Логотип сайта" height="30" width="100">
                </a>
            </div>
            <nav>
                <ul class="flex gap-16 text-2xl font-medium">
                    <li>
                        <a class="py-5" href="#park">Парки</a>
                    </li>
                    <li>
                        <a class="py-5" href="#flora">Флора</a>
                    </li>
                    <li>
                        <a class="py-5" href="#fauna">Фауна</a>
                    </li>
                    <li>
                        <a class="py-5" href="#comment-section">Предложения</a>
                    </li>
                </ul>
            </nav>
            <div class="flex justify-center pt-4">
                <button class="w-full flex justify-center items-center bg-main text-white font-semibold transition duration-200 rounded-[30px] text-xl uppercase py-3 px-20 lg:hover:bg-hover active:bg-hover focus:bg-hover focus:border-accent focus:outline-accent focus:ring-0 focus:ring-accent"
                        type="submit" name="login-moder">
                    Вход
                </button>
            </div>
        </div>
    </footer>
</body>
</html>
